### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [13]:
# Dependencies and Setup
import pandas as pd
import numpy as np



data= pd.read_csv("Resources/purchase_data.csv")

In [14]:
#Get Total Players

playerdf= data.nunique()
uniqueplayers=playerdf['SN']
uniqueplayers

data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,101,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [15]:
uniqueplayers

576

In [16]:
#Get Numbers of Unique items
uniqueitems= data.nunique()
p=uniqueitems['Item ID']
p

183

avgprice=data.nunique()
avgprice2=avgprice['Price'].mean()
avgprice2

In [17]:
avgprice=data.nunique()
avgprice2=avgprice['Price'].mean()
avgprice2

145.0

In [18]:
#Total Revenue
Totalrevenue=data
totalrev=Totalrevenue['Price'].sum()
totalrev

2379.77

In [19]:
analytic=pd.DataFrame({'Number of Unique Items': p,'avg price':avgprice2, "total revenue" :totalrev, 'Unique Items': p}, index=['Purchasing Analysis-Male'
])

analytic

,Number of Unique Items,avg price,total revenue,Unique Items
Purchasing Analysis-Male,183,145.0,2379.77,183

In [20]:

Gender=data['Gender'].value_counts(normalize=True,) * 100

Gender.head()

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [21]:
data_g2 = data.loc[data["Gender"] == "Male", :]
data_f2 = data.loc[data["Gender"] == "Female", :]
data_o2= data.loc[data["Gender"] == "Other / Non-Disclosed", :]

In [22]:
# Filter the data so that only those sightings in the US are in a DataFrame


Totalrevenue2=data_g2
uniqueitems2= data_g2.nunique()
p2=uniqueitems2['Item ID']
avgprice3=data_g2['Price'].mean()
totalrev2=Totalrevenue2['Price'].sum()



data_g3=pd.DataFrame({'Number of Unique Items': p2,'avg price':avgprice3, "total revenue" :totalrev2, 'Unique Items': p}, index=['Purchasing Analysis-Male'
])
data_g3

,Number of Unique Items,avg price,total revenue,Unique Items
Purchasing Analysis-Male,182,3.017853,1967.64,183

In [23]:
# Other Stats
Totalrevenue4=data_o2
totalrev4=Totalrevenue4['Price'].sum()
#Unqiue orders
uniqueitems4= data_o2.nunique()
p4=uniqueitems4['Item ID']
#Average Price
avgprice4=data_o2['Price'].mean()



#create female grid
data_f4=pd.DataFrame({'Purchase Count': p4,'avg price':avgprice4, "total revenue" :totalrev4, 'Unique Items': p4}, index=['Purchasing Analysis: Other'
])
data_f4

,Purchase Count,avg price,total revenue,Unique Items
Purchasing Analysis: Other,13,3.346,50.19,13

In [24]:
# Female Stats
Totalrevenue3=data_f2
totalrev3=Totalrevenue3['Price'].sum()
#Unqiue orders
uniqueitems3= data_f2.nunique()
p3=uniqueitems3['Item ID']
#Average Price
avgprice3=data_f2['Price'].mean()



#create female grid
data_f3=pd.DataFrame({'Purchase Count': p3,'avg price':avgprice3, "total revenue" :totalrev3, 'Unique Items': p3}, index=['Purchasing Analysis: Female'
])
data_f3

,Purchase Count,avg price,total revenue,Unique Items
Purchasing Analysis: Female,90,3.203009,361.94,90

In [25]:
#Total Added up


total2=pd.DataFrame(data_g3)
total3=total2.append(data_f4)
total4=total3.append(data_f3)
total4

C:\Users\micha\Anaconda3\lib\site-packages\pandas\core\frame.py:7123: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort,

,Number of Unique Items,Purchase Count,Unique Items,avg price,total revenue
Purchasing Analysis-Male,182.0,NaN,183,3.017853,1967.64
Purchasing Analysis: Other,NaN,13.0,13,3.346000,50.19
Purchasing Analysis: Female,NaN,90.0,90,3.203009,361.94

In [26]:
#* The below each broken into bins of 4 years (i.e. &lt;10, 10-14, 15-19, etc.)
# * Purchase Count
#* Average Purchase Price
# Total Purchase Value
#* Average Purchase Total per Person by Age Group

bins=[0, 10, 15, 20, 25, 30, 35, 40, 90]
bin_names=['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '35-39', '40+']
data['Total Count']=pd.cut(data['Age'],
                                     bins, labels=bin_names)

proage=data.groupby('Total Count')
proage_df=proage.count()

purchasecount=data.groupby('SN')
new=purchasecount.count()


data['SN']=pd.cut(data['Age'],
                 bins, labels=bin_names)

finalage=proage_df[['Age']]
finalage.columns= ['Age Group',]
finalage2=finalage.rename_axis('Group')
new1=finalage2
finalage2

       Age Group
Group
<10           32
10-14         54
15-19        200
20-24        325
25-29         77
30-34         52
35-39         33
40+            7

In [27]:
finalage2

       Age Group
Group
<10           32
10-14         54
15-19        200
20-24        325
25-29         77
30-34         52
35-39         33
40+            7

In [28]:
data['SN']=pd.cut(data['Age'],
                 bins, labels=bin_names)
new100=data
new100

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Count
0,0,15-19,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,35-39,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,20-24,24,Male,92,Final Critic,4.88,20-24
3,3,20-24,24,Male,100,Blindscythe,3.27,20-24
4,4,20-24,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,20-24,21,Female,60,Wolf,3.54,20-24
776,776,20-24,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,15-19,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,15-19
778,778,<10,7,Male,101,Final Critic,4.19,<10
779,779,20-24,24,Male,50,Dawn,4.60,20-24

In [29]:
new1

       Age Group
Group
<10           32
10-14         54
15-19        200
20-24        325
25-29         77
30-34         52
35-39         33
40+            7

NameError: name 'new12' is not defined

In [68]:
Spending_total = data.groupby(['SN'])
purchase_count = Spending_total['Item ID'].count()
avg_purchase_price = Spending_total['Price'].mean()
total_purchase_value = Spending_total['Price'].sum()
Final_Spending = pd.DataFrame({'Purchase Count':purchase_count,
                                'Average Purchase Price':avg_purchase_price,
                                'Total Purchase Value':total_purchase_value})
Final_Spending = Final_Spending.sort_values(['Total Purchase Value'],ascending=False)
Final_Spending = Final_Spending.head(5).style.format({'Average Purchase Price':"${:.2f}",'Total Purchase Value':"${:.2f}"})
Final_Spending

In [69]:
popular_items = data[['Item ID','Item Name','Price']]
grouped_popular_items = popular_items.groupby(['Item ID','Item Name'])

count_of_purchases = grouped_popular_items['Item Name'].count()
purchase_values = grouped_popular_items['Price'].sum()
prices_items = grouped_popular_items['Price'].mean()
items_that_are_popular_df = pd.DataFrame({'Purchase Count':count_of_purchases,
                                     'Item Price':prices_items,
                                     'Total Purchase Value':purchase_values})

items_that_are_popular_df = items_that_are_popular_df.sort_values(['Purchase Count'], ascending=0)
items_that_are_popular_df = items_that_are_popular_df.head(5).style.format({'Item Price':"${:.2f}",'Total Purchase Value':"${:.2f}"})
items_that_are_popular_df

## Player Count

* Display the total number of players

AttributeError: 'Styler' object has no attribute 'sort_values'

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame